maze = [[9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
        [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
        [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
        [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
        [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9],
        [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 0, 9],
        [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 1, 9],
        [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9],
        [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9],
        [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9],
        [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9],
        [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]]

def search(x, y, depth):
    # 목표에 도달하면 종료
    if maze[x][y] == 1:
        print(depth)
        exit()

    # 탐색 완료로 설정
    maze[x][y] = 2

    # 상하좌우 탐색
    if maze[x - 1][y] < 2:
        search(x - 1, y, depth + 1) # 이동 횟수를 늘려 왼쪽을 탐색
    if maze[x + 1][y] < 2:
        search(x + 1, y, depth + 1) # 이동 횟수를 늘려 오른쪽을 탐색
    if maze[x][y - 1] < 2:
        search(x, y - 1, depth + 1) # 이동 횟수를 늘려 위쪽을 탐색
    if maze[x][y + 1] < 2:
        search(x, y + 1, depth + 1) # 이동 횟수를 늘려 아래쪽을 탐색

    # 탐색 전으로 되돌리기
    maze[x][y] = 0

# 시작 위치에서 출발
search(1, 1, 0)